app/views/quotes/_form.html.erb

  <div id="categories-container">
    <% @quote.quote_categories.each do |quote_category| %>
---
SELECT "quote_categories".* FROM "quote_categories" WHERE "quote_categories"."quote_id" = 17
SELECT "categories".* FROM "categories"

            <%= qc.label :category_id, "Category", class: "form-label d-inline-block me-2" %>
            <%= qc.select :category_id, Category.all.collect { |cat| [cat.name, cat.id] }, { include_blank: true }, class: "form-control d-inline-block" %>
---
SELECT "categories"."id" FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = 18