app/views/quotes/_quote.html.erb

    <!-- Display each category in a list -->
    <% quote.quote_categories.each do |qc|%>
---
SELECT "quotes".* FROM "quotes"
SELECT "quote_categories".* FROM "quote_categories" WHERE "quote_categories"."quote_id" = 4

    <strong>Philosopher Name:</strong>
    <%= quote.philosopher.present? ? "#{quote.philosopher.fname} #{quote.philosopher.lname}".strip : "Anonymous" %>
---
SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" = 1 LIMIT 1