app/views/search/index.html.erb

SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" = 2 LIMIT 1
---
                <h5 class="card-title"><%= quote.quote_content %></h5>
                <p class="card-text"><%= quote.philosopher.present? ? "#{quote.philosopher.fname} #{quote.philosopher.lname}".strip : "Anonymous" %><br />[<a href="/quotes/<%= quote.id %>">Read full quote</a>]</p>