app/views/home/uquotes.html.erb

        <!-- Display philosopher name by referring to the phiolosopher_id -->
        <p class="card-text"><%= quote.philosopher.present? ? "#{quote.philosopher.fname} #{quote.philosopher.lname}".strip : "Anonymous" %><br />[<a href="/quotes/<%= quote.id %>">Read full quote</a>]</p>
---
SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" = 1 LIMIT 1