app/controllers/home_controller.rb

  def index
    @quotes = Quote.includes(:philosopher).where(is_public: true).order(created_at: :desc).limit(10)
---
SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" IN (4, 3)
SELECT "quotes".* FROM "quotes" WHERE "quotes"."is_public" = 1 ORDER BY "quotes"."created_at" DESC LIMIT 10

  def uquotes
    @quotes = Quote.includes(:categories).where(user_id: session[:user_id])
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."user_id" = 4
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (8, 5)