app/controllers/quotes_controller.rb

SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = 13 LIMIT 1
---
  def edit
    @quote = Quote.find(params[:id])

SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."fname" = 'Anonymous' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "categories".* FROM "categories" WHERE "categories"."name" = 'Uncategorized' LIMIT 1
INSERT INTO "philosophers" ("fname", "lname", "birth_year", "death_year", "biography", "created_at", "updated_at") VALUES ('Test', 'Phil', NULL, NULL, 'IDK man', '2025-10-19 17:17:45.490079', '2025-10-19 17:17:45.490079') RETURNING "id"
INSERT INTO "quote_categories" ("quote_id", "category_id", "created_at", "updated_at") VALUES (11, 11, '2025-10-17 17:37:28.838039', '2025-10-17 17:37:28.838039') RETURNING "id"
INSERT INTO "quotes" ("quote_content", "pub_year", "is_public", "comment", "user_id", "philosopher_id", "created_at", "updated_at") VALUES ('test', NULL, 0, '', 2, 1, '2025-10-17 17:37:28.831846', '2025-10-17 17:37:28.831846') RETURNING "id"
INSERT INTO "quote_categories" ("quote_id", "category_id", "created_at", "updated_at") VALUES (40, 1, '2025-10-20 13:12:24.308658', '2025-10-20 13:12:24.308658') RETURNING "id"
INSERT INTO "quotes" ("quote_content", "pub_year", "is_public", "comment", "user_id", "philosopher_id", "created_at", "updated_at") VALUES ('Test Quote', NULL, 1, 'Comment_1', 2, 1, '2025-10-20 13:12:24.302404', '2025-10-20 13:12:24.302404') RETURNING "id"
SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = 1 LIMIT 1
SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" = 1 LIMIT 1
SELECT "quote_categories".* FROM "quote_categories" WHERE "quote_categories"."quote_id" = 1
---
  def create
    @quote = Quote.new(quote_params)
    @quote.user = current_user  # assign current user

    if @quote.philosopher.nil? && (quote_params[:philosopher_attributes].blank? || quote_params[:philosopher_attributes][:fname].blank?)
      @quote.philosopher = Philosopher.find_by(fname: 'Anonymous') || Philosopher.find(1)
    end

    if @quote.categories.empty?
      uncategorized = Category.find_by(name: 'Uncategorized') || Category.find(1)
      @quote.categories << uncategorized if uncategorized
    end

    respond_to do |format|
      if @quote.save
        format.html { redirect_to @quote, notice: "Quote was successfully created." }
        format.json { render :show, status: :created, location: @quote }
      else
        @quote.quote_categories.build if @quote.quote_categories.empty?

UPDATE "quotes" SET "quote_content" = 'Test Quote_456456', "updated_at" = '2025-10-20 13:17:40.565869' WHERE "quotes"."id" = 40
---
  def update
    respond_to do |format|
      if @quote.update(quote_params)

DELETE FROM "quotes" WHERE "quotes"."id" = 40
---
  def destroy
    @quote.destroy!

SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = 40 LIMIT 1
---
    def set_quote
      @quote = Quote.find(params[:id])