app/controllers/users_controller.rb

  def index
    #@users = User.all
    if logged_in? && is_administrator?
      @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("fname", "lname", "email", "password_digest", "status", "is_admin", "created_at", "updated_at") VALUES ('Bat', 'Man', 'Batman@email.com', '$2a$12$YZyX3CdcilrXmMNenYLY.ONmzUYkcisAElwY4919SX7mx/b4O1lsW', 'Active', 0, '2025-10-17 18:01:16.207390', '2025-10-17 18:01:16.207390') RETURNING "id"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "password_digest" = '$2a$12$fKn26Mch/1yVdmKbAuKZK.lzLiiJ42MDl7JFgfkdqutSc27xQnA4q', "updated_at" = '2025-10-20 07:47:34.938755' WHERE "users"."id" = 8

  def destroy
    @user.destroy!
---
DELETE FROM "users" WHERE "users"."id" = 7

    def set_user
      @user = User.find(params.expect(:id))
---
SELECT "users".* FROM "users" WHERE "users"."id" = 5 LIMIT 1